<?php

namespace Database\Seeders;

use App\Models\CoreConfigs\Subject;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class SubjectSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {

        $data = [
            ['code' => '513116', 'name' => 'ทฤษฎี หลักการและกรอบแนวคิดเบื้องต้นทางกิจกรรมบำบัด', 'status' => 'active'],
            ['code' => '513117', 'name' => 'พัฒนาการและความสามารถการทำกิจกรรมการดำเนินชีวิตของมนุษย์ทุกช่วงวัย', 'status' => 'active'],
            ['code' => '513120', 'name' => 'กิจกรรมการดำเนินชีวิตและสื่อการบำบัดในงานกิจกรรมบำบัด', 'status' => 'active'],
            ['code' => '513226', 'name' => 'การประเมินทางคลินิกกิจกรรมบำบัด 1', 'status' => 'active'],
            ['code' => '513228', 'name' => 'ชีวกลศาสตร์ประยุกต์ทางกิจกรรมบำบัด', 'status' => 'active'],
            ['code' => '513285', 'name' => 'หลักการพื้นฐานของกิจกรรมบำบัดด้านสุขภาพจิต', 'status' => 'active'],
            ['code' => '513227', 'name' => 'การประเมินทางคลินิกกิจกรรมบำบัด 2', 'status' => 'active'],
            ['code' => '513271', 'name' => 'โรคและความบกพร่องในเด็กกับการทำกิจกรรมการดำเนินชีวิต', 'status' => 'active'],
            ['code' => '513286', 'name' => 'เทคนิควิธีการทางกิจกรรมบำบัดด้านสุขภาพจิต', 'status' => 'active'],
            ['code' => '513313', 'name' => 'ประสาทวิทยาศาสตร์กับการทำกิจกรรมการดำเนินชีวิต', 'status' => 'active'],
            ['code' => '513321', 'name' => 'การฝึกกิจวัตรประจำวัน', 'status' => 'active'],
            ['code' => '513322', 'name' => 'อุปกรณ์ดาม และเทคโนโลยีเครื่องช่วยในงานกิจกรรมบำบัด', 'status' => 'active'],
            ['code' => '513332', 'name' => 'ระเบียบวิธีวิจัยสำหรับนักศึกษากิจกรรมบำบัด', 'status' => 'active'],
            ['code' => '513344', 'name' => 'ฝึกปฏิบัติงานทางกิจกรรมบำบัด 1', 'status' => 'active'],
            ['code' => '513365', 'name' => 'กิจกรรมบำบัดในภาวะทางระบบประสาท', 'status' => 'active'],
            ['code' => '513374', 'name' => 'การประเมินทางกิจกรรมบำบัดสำหรับเด็ก', 'status' => 'active'],
            ['code' => '513312', 'name' => 'กิจกรรมบำบัดสำหรับผู้ที่มีความผิดปกติทางการสื่อความหมาย', 'status' => 'active'],
            ['code' => '513333', 'name' => 'สัมมนาวารสารทางกิจกรรมบำบัด', 'status' => 'active'],
            ['code' => '513345', 'name' => 'ฝึกปฏิบัติงานทางกิจกรรมบำบัด 2', 'status' => 'active'],
            ['code' => '513366', 'name' => 'กิจกรรมบำบัดในภาวะทางออร์โธปีดิกส์และทางอายุรศาสตร์', 'status' => 'active'],
            ['code' => '513375', 'name' => 'การบำบัดรักษาทางกิจกรรมบำบัดสำหรับเด็ก', 'status' => 'active'],
            ['code' => '513393', 'name' => 'กิจกรรมบำบัดสำหรับผู้สูงอายุ', 'status' => 'active'],
            ['code' => '513421', 'name' => 'การให้เหตุผลทางการรักษาทางกิจกรรมบำบัด', 'status' => 'active'],
            ['code' => '513435', 'name' => 'การพัฒนาโครงร่างการวิจัยทางกิจกรรมบำบัด', 'status' => 'active'],
            ['code' => '513447', 'name' => 'ฝึกปฏิบัติงานทางกิจกรรมบำบัด 3', 'status' => 'active'],
            ['code' => '513452', 'name' => 'กิจกรรมบำบัดในชุมชน', 'status' => 'active'],
            ['code' => '513453', 'name' => 'กิจกรรมบำบัดในสถานศึกษา', 'status' => 'active'],
            ['code' => '513413', 'name' => 'การบริหารและจรรยาบรรณของนักกิจกรรมบำบัด', 'status' => 'active'],
            ['code' => '513436', 'name' => 'การวิจัยทางกิจกรรมบำบัด', 'status' => 'active'],
            ['code' => '513448', 'name' => 'ฝึกปฏิบัติงานทางกิจกรรมบำบัด 4', 'status' => 'active'],
        ];
        foreach ($data as $key => $subject) {
            Subject::create($subject);
        }
    }
}
